name:"r18"
layer{
    name:"data"
    type:"Data"
    top:"data"
    top:"label"
    include{
        phase:TRAIN
    }
    transform_param{
        scale:0.0078125
        mean_value:127.0
        mirror:true
    }
    data_param{
        source:"/home/lc/gender/school/data_3/train.lmdb"
        batch_size:8
        backend:LMDB
    }
}
layer{
    name:"data"
    type:"Data"
    top:"data"
    top:"label"
    include{
        phase:TEST
    }
    transform_param{
        scale:0.0078125
        mean_value:127.0
        mirror:true
    }
    data_param{
        source:"/home/lc/gender/school/data_3/val.lmdb"
        batch_size:8
        backend:LMDB
    }
}

layer {
	bottom: "data"
	top: "conv0"
	name: "conv0"
	type: "Convolution"
    param {
      lr_mult: 1
      decay_mult: 1
    }
	convolution_param {
		num_output: 64
		kernel_size: 3
		pad: 1
		stride: 1
        engine:CAFFE    
        weight_filler {
           type: "gaussian"
           std: 0.01
        }
		bias_term: false
	}
}

layer {
  bottom: "conv0"
  top: "bn0"
  name: "bn0"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.9
    eps: 2e-05
  }
}
layer {
  bottom: "bn0"
  top: "bn0"
  name: "bn0_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "bn0"
  top: "relu0"
  name: "relu0"
  type: "ReLU"
}

layer {
  bottom: "relu0"
  top: "stage1_unit1_bn1"
  name: "stage1_unit1_bn1"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.9
    eps: 2e-05
  }
}
layer {
  bottom: "stage1_unit1_bn1"
  top: "stage1_unit1_bn1"
  name: "stage1_unit1_bn1_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
	bottom: "stage1_unit1_bn1"
	top: "stage1_unit1_conv1"
	name: "stage1_unit1_conv1"
	type: "Convolution"
    param {
      lr_mult: 1
      decay_mult: 1
    }
	convolution_param {
		num_output: 64
		kernel_size: 3
		pad: 1
		stride: 1    
        weight_filler {
           type: "gaussian"
           std: 0.01
        }
        engine:CAFFE
		bias_term: false
	}
}

layer {
  bottom: "stage1_unit1_conv1"
  top: "stage1_unit1_bn2"
  name: "stage1_unit1_bn2"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.9
    eps: 2e-05
  }
}
layer {
  bottom: "stage1_unit1_bn2"
  top: "stage1_unit1_bn2"
  name: "stage1_unit1_bn2_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "stage1_unit1_bn2"
  top: "stage1_unit1_relu1"
  name: "stage1_unit1_relu1"
  type: "ReLU"
}

layer {
	bottom: "stage1_unit1_relu1"
	top: "stage1_unit1_conv2"
	name: "stage1_unit1_conv2"
	type: "Convolution"
    param {
      lr_mult: 1
      decay_mult: 1
    }
	convolution_param {
		num_output: 64
		kernel_size: 3
		pad: 1
		stride: 2    
        weight_filler {
           type: "gaussian"
           std: 0.01
        }
        engine:CAFFE
		bias_term: false
	}
}

layer {
  bottom: "stage1_unit1_conv2"
  top: "stage1_unit1_bn3"
  name: "stage1_unit1_bn3"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats:false
    moving_average_fraction: 0.9
    eps: 2e-05
  }
}
layer {
  bottom: "stage1_unit1_bn3"
  top: "stage1_unit1_bn3"
  name: "stage1_unit1_bn3_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
	bottom: "relu0"
	top: "stage1_unit1_conv1sc"
	name: "stage1_unit1_conv1sc"
	type: "Convolution"
    param {
      lr_mult: 1
      decay_mult: 1
    }
	convolution_param {
		num_output: 64
		kernel_size: 1
		stride: 2    
        weight_filler {
           type: "gaussian"
           std: 0.01
        }
        engine:CAFFE
		bias_term: false
	}
}

layer {
  bottom: "stage1_unit1_conv1sc"
  top: "stage1_unit1_sc"
  name: "stage1_unit1_sc"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.9
    eps: 2e-05
  }
}
layer {
  bottom: "stage1_unit1_sc"
  top: "stage1_unit1_sc"
  name: "stage1_unit1_sc_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  name: "_plus0"
  type: "Eltwise"
  bottom: "stage1_unit1_bn3"
  bottom: "stage1_unit1_sc"
  top: "_plus0"
  eltwise_param { operation: SUM }
}

layer {
  bottom: "_plus0"
  top: "stage1_unit2_bn1"
  name: "stage1_unit2_bn1"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.9
    eps: 2e-05
  }
}
layer {
  bottom: "stage1_unit2_bn1"
  top: "stage1_unit2_bn1"
  name: "stage1_unit2_bn1_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
	bottom: "stage1_unit2_bn1"
	top: "stage1_unit2_conv1"
	name: "stage1_unit2_conv1"
	type: "Convolution"
    param {
      lr_mult: 1
      decay_mult: 1
    }
	convolution_param {
		num_output: 64
		kernel_size: 3
		pad: 1
		stride: 1    
        weight_filler {
           type: "gaussian"
           std: 0.01
        }
        engine:CAFFE
		bias_term: false
	}
}

layer {
  bottom: "stage1_unit2_conv1"
  top: "stage1_unit2_bn2"
  name: "stage1_unit2_bn2"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.9
    eps: 2e-05
  }
}
layer {
  bottom: "stage1_unit2_bn2"
  top: "stage1_unit2_bn2"
  name: "stage1_unit2_bn2_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "stage1_unit2_bn2"
  top: "stage1_unit2_relu1"
  name: "stage1_unit2_relu1"
  type: "ReLU"
}

layer {
	bottom: "stage1_unit2_relu1"
	top: "stage1_unit2_conv2"
	name: "stage1_unit2_conv2"
	type: "Convolution"
    param {
      lr_mult: 1
      decay_mult: 1
    }
	convolution_param {
		num_output: 64
		kernel_size: 3
		pad: 1
		stride: 1    
        weight_filler {
           type: "gaussian"
           std: 0.01
        }
        engine:CAFFE
		bias_term: false
	}
}

layer {
  bottom: "stage1_unit2_conv2"
  top: "stage1_unit2_bn3"
  name: "stage1_unit2_bn3"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.9
    eps: 2e-05
  }
}
layer {
  bottom: "stage1_unit2_bn3"
  top: "stage1_unit2_bn3"
  name: "stage1_unit2_bn3_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  name: "_plus1"
  type: "Eltwise"
  bottom: "stage1_unit2_bn3"
  bottom: "_plus0"
  top: "_plus1"
  eltwise_param { operation: SUM }
}

layer {
  bottom: "_plus1"
  top: "stage2_unit1_bn1"
  name: "stage2_unit1_bn1"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.9
    eps: 2e-05
  }
}
layer {
  bottom: "stage2_unit1_bn1"
  top: "stage2_unit1_bn1"
  name: "stage2_unit1_bn1_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
	bottom: "stage2_unit1_bn1"
	top: "stage2_unit1_conv1"
	name: "stage2_unit1_conv1"
	type: "Convolution"
    param {
      lr_mult: 1
      decay_mult: 1
    }
	convolution_param {
		num_output: 128
		kernel_size: 3
		pad: 1
		stride: 1    
        weight_filler {
           type: "gaussian"
           std: 0.01
        }
        engine:CAFFE
		bias_term: false
	}
}

layer {
  bottom: "stage2_unit1_conv1"
  top: "stage2_unit1_bn2"
  name: "stage2_unit1_bn2"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.9
    eps: 2e-05
  }
}
layer {
  bottom: "stage2_unit1_bn2"
  top: "stage2_unit1_bn2"
  name: "stage2_unit1_bn2_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "stage2_unit1_bn2"
  top: "stage2_unit1_relu1"
  name: "stage2_unit1_relu1"
  type: "ReLU"
}

layer {
	bottom: "stage2_unit1_relu1"
	top: "stage2_unit1_conv2"
	name: "stage2_unit1_conv2"
	type: "Convolution"
    param {
      lr_mult: 1
      decay_mult: 1
    }
	convolution_param {
		num_output: 128
		kernel_size: 3
		pad: 1
		stride: 2    
        weight_filler {
           type: "gaussian"
           std: 0.01
        }
        engine:CAFFE
		bias_term: false
	}
}

layer {
  bottom: "stage2_unit1_conv2"
  top: "stage2_unit1_bn3"
  name: "stage2_unit1_bn3"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.9
    eps: 2e-05
  }
}
layer {
  bottom: "stage2_unit1_bn3"
  top: "stage2_unit1_bn3"
  name: "stage2_unit1_bn3_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
	bottom: "_plus1"
	top: "stage2_unit1_conv1sc"
	name: "stage2_unit1_conv1sc"
	type: "Convolution"
    param {
      lr_mult: 1
      decay_mult: 1
    }
	convolution_param {
		num_output: 128
		kernel_size: 1
		stride: 2    
        weight_filler {
           type: "gaussian"
           std: 0.01
        }
        engine:CAFFE
		bias_term: false
	}
}

layer {
  bottom: "stage2_unit1_conv1sc"
  top: "stage2_unit1_sc"
  name: "stage2_unit1_sc"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.9
    eps: 2e-05
  }
}
layer {
  bottom: "stage2_unit1_sc"
  top: "stage2_unit1_sc"
  name: "stage2_unit1_sc_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  name: "_plus2"
  type: "Eltwise"
  bottom: "stage2_unit1_bn3"
  bottom: "stage2_unit1_sc"
  top: "_plus2"
  eltwise_param { operation: SUM }
}

layer {
  bottom: "_plus2"
  top: "stage2_unit2_bn1"
  name: "stage2_unit2_bn1"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.9
    eps: 2e-05
  }
}
layer {
  bottom: "stage2_unit2_bn1"
  top: "stage2_unit2_bn1"
  name: "stage2_unit2_bn1_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
	bottom: "stage2_unit2_bn1"
	top: "stage2_unit2_conv1"
	name: "stage2_unit2_conv1"
	type: "Convolution"
    param {
      lr_mult: 1
      decay_mult: 1
    }
	convolution_param {
		num_output: 128
		kernel_size: 3
		pad: 1
		stride: 1    
        weight_filler {
           type: "gaussian"
           std: 0.01
        }
        engine:CAFFE
		bias_term: false
	}
}

layer {
  bottom: "stage2_unit2_conv1"
  top: "stage2_unit2_bn2"
  name: "stage2_unit2_bn2"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.9
    eps: 2e-05
  }
}
layer {
  bottom: "stage2_unit2_bn2"
  top: "stage2_unit2_bn2"
  name: "stage2_unit2_bn2_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "stage2_unit2_bn2"
  top: "stage2_unit2_relu1"
  name: "stage2_unit2_relu1"
  type: "ReLU"
}

layer {
	bottom: "stage2_unit2_relu1"
	top: "stage2_unit2_conv2"
	name: "stage2_unit2_conv2"
	type: "Convolution"
    param {
      lr_mult: 1
      decay_mult: 1
    }
	convolution_param {
		num_output: 128
		kernel_size: 3
		pad: 1
		stride: 1    
        weight_filler {
           type: "gaussian"
           std: 0.01
        }
        engine:CAFFE
		bias_term: false
	}
}

layer {
  bottom: "stage2_unit2_conv2"
  top: "stage2_unit2_bn3"
  name: "stage2_unit2_bn3"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.9
    eps: 2e-05
  }
}
layer {
  bottom: "stage2_unit2_bn3"
  top: "stage2_unit2_bn3"
  name: "stage2_unit2_bn3_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  name: "_plus3"
  type: "Eltwise"
  bottom: "stage2_unit2_bn3"
  bottom: "_plus2"
  top: "_plus3"
  eltwise_param { operation: SUM }
}

layer {
  bottom: "_plus3"
  top: "stage3_unit1_bn1"
  name: "stage3_unit1_bn1"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.9
    eps: 2e-05
  }
}
layer {
  bottom: "stage3_unit1_bn1"
  top: "stage3_unit1_bn1"
  name: "stage3_unit1_bn1_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
	bottom: "stage3_unit1_bn1"
	top: "stage3_unit1_conv1"
	name: "stage3_unit1_conv1"
	type: "Convolution"
    param {
      lr_mult: 1
      decay_mult: 1
    }
	convolution_param {
		num_output: 256
		kernel_size: 3
		pad: 1
		stride: 1    
        weight_filler {
           type: "gaussian"
           std: 0.01
        }
        engine:CAFFE
		bias_term: false
	}
}

layer {
  bottom: "stage3_unit1_conv1"
  top: "stage3_unit1_bn2"
  name: "stage3_unit1_bn2"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.9
    eps: 2e-05
  }
}
layer {
  bottom: "stage3_unit1_bn2"
  top: "stage3_unit1_bn2"
  name: "stage3_unit1_bn2_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "stage3_unit1_bn2"
  top: "stage3_unit1_relu1"
  name: "stage3_unit1_relu1"
  type: "ReLU"
}

layer {
	bottom: "stage3_unit1_relu1"
	top: "stage3_unit1_conv2"
	name: "stage3_unit1_conv2"
	type: "Convolution"
    param {
      lr_mult: 1
      decay_mult: 1
    }
	convolution_param {
		num_output: 256
		kernel_size: 3
		pad: 1
		stride: 2    
        weight_filler {
           type: "gaussian"
           std: 0.01
        }
        engine:CAFFE
		bias_term: false
	}
}

layer {
  bottom: "stage3_unit1_conv2"
  top: "stage3_unit1_bn3"
  name: "stage3_unit1_bn3"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.9
    eps: 2e-05
  }
}
layer {
  bottom: "stage3_unit1_bn3"
  top: "stage3_unit1_bn3"
  name: "stage3_unit1_bn3_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
	bottom: "_plus3"
	top: "stage3_unit1_conv1sc"
	name: "stage3_unit1_conv1sc"
	type: "Convolution"
    param {
      lr_mult: 1
      decay_mult: 1
    }
	convolution_param {
		num_output: 256
		kernel_size: 1
		stride: 2    
        weight_filler {
           type: "gaussian"
           std: 0.01
        }
        engine:CAFFE
		bias_term: false
	}
}

layer {
  bottom: "stage3_unit1_conv1sc"
  top: "stage3_unit1_sc"
  name: "stage3_unit1_sc"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.9
    eps: 2e-05
  }
}
layer {
  bottom: "stage3_unit1_sc"
  top: "stage3_unit1_sc"
  name: "stage3_unit1_sc_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  name: "_plus4"
  type: "Eltwise"
  bottom: "stage3_unit1_bn3"
  bottom: "stage3_unit1_sc"
  top: "_plus4"
  eltwise_param { operation: SUM }
}

layer {
  bottom: "_plus4"
  top: "stage3_unit2_bn1"
  name: "stage3_unit2_bn1"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.9
    eps: 2e-05
  }
}
layer {
  bottom: "stage3_unit2_bn1"
  top: "stage3_unit2_bn1"
  name: "stage3_unit2_bn1_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
	bottom: "stage3_unit2_bn1"
	top: "stage3_unit2_conv1"
	name: "stage3_unit2_conv1"
	type: "Convolution"
    param {
      lr_mult: 1
      decay_mult: 1
    }
	convolution_param {
		num_output: 256
		kernel_size: 3
		pad: 1
		stride: 1    
        weight_filler {
           type: "gaussian"
           std: 0.01
        }
        engine:CAFFE
		bias_term: false
	}
}

layer {
  bottom: "stage3_unit2_conv1"
  top: "stage3_unit2_bn2"
  name: "stage3_unit2_bn2"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.9
    eps: 2e-05
  }
}
layer {
  bottom: "stage3_unit2_bn2"
  top: "stage3_unit2_bn2"
  name: "stage3_unit2_bn2_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "stage3_unit2_bn2"
  top: "stage3_unit2_relu1"
  name: "stage3_unit2_relu1"
  type: "ReLU"
}

layer {
	bottom: "stage3_unit2_relu1"
	top: "stage3_unit2_conv2"
	name: "stage3_unit2_conv2"
	type: "Convolution"
    param {
      lr_mult: 1
      decay_mult: 1
    }
	convolution_param {
		num_output: 256
		kernel_size: 3
		pad: 1
		stride: 1    
        weight_filler {
           type: "gaussian"
           std: 0.01
        }
        engine:CAFFE
		bias_term: false
	}
}

layer {
  bottom: "stage3_unit2_conv2"
  top: "stage3_unit2_bn3"
  name: "stage3_unit2_bn3"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.9
    eps: 2e-05
  }
}
layer {
  bottom: "stage3_unit2_bn3"
  top: "stage3_unit2_bn3"
  name: "stage3_unit2_bn3_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  name: "_plus5"
  type: "Eltwise"
  bottom: "stage3_unit2_bn3"
  bottom: "_plus4"
  top: "_plus5"
  eltwise_param { operation: SUM }
}

layer {
  bottom: "_plus5"
  top: "stage4_unit1_bn1"
  name: "stage4_unit1_bn1"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.9
    eps: 2e-05
  }
}
layer {
  bottom: "stage4_unit1_bn1"
  top: "stage4_unit1_bn1"
  name: "stage4_unit1_bn1_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
	bottom: "stage4_unit1_bn1"
	top: "stage4_unit1_conv1"
	name: "stage4_unit1_conv1"
	type: "Convolution"
    param {
      lr_mult: 1
      decay_mult: 1
    }
	convolution_param {
		num_output: 512
		kernel_size: 3
		pad: 1
		stride: 1    
        weight_filler {
           type: "gaussian"
           std: 0.01
        }
        engine:CAFFE
		bias_term: false
	}
}

layer {
  bottom: "stage4_unit1_conv1"
  top: "stage4_unit1_bn2"
  name: "stage4_unit1_bn2"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.9
    eps: 2e-05
  }
}
layer {
  bottom: "stage4_unit1_bn2"
  top: "stage4_unit1_bn2"
  name: "stage4_unit1_bn2_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "stage4_unit1_bn2"
  top: "stage4_unit1_relu1"
  name: "stage4_unit1_relu1"
  type: "ReLU"
}

layer {
	bottom: "stage4_unit1_relu1"
	top: "stage4_unit1_conv2"
	name: "stage4_unit1_conv2"
	type: "Convolution"
    param {
      lr_mult: 1
      decay_mult: 1
    }
	convolution_param {
		num_output: 512
		kernel_size: 3
		pad: 1
		stride: 2    
        weight_filler {
           type: "gaussian"
           std: 0.01
        }
        engine:CAFFE
		bias_term: false
	}
}

layer {
  bottom: "stage4_unit1_conv2"
  top: "stage4_unit1_bn3"
  name: "stage4_unit1_bn3"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.9
    eps: 2e-05
  }
}
layer {
  bottom: "stage4_unit1_bn3"
  top: "stage4_unit1_bn3"
  name: "stage4_unit1_bn3_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
	bottom: "_plus5"
	top: "stage4_unit1_conv1sc"
	name: "stage4_unit1_conv1sc"
	type: "Convolution"
    param {
      lr_mult: 1
      decay_mult: 1
    }
	convolution_param {
		num_output: 512
		kernel_size: 1
		stride: 2    
        weight_filler {
           type: "gaussian"
           std: 0.01
        }
        engine:CAFFE
		bias_term: false
	}
}

layer {
  bottom: "stage4_unit1_conv1sc"
  top: "stage4_unit1_sc"
  name: "stage4_unit1_sc"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.9
    eps: 2e-05
  }
}
layer {
  bottom: "stage4_unit1_sc"
  top: "stage4_unit1_sc"
  name: "stage4_unit1_sc_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  name: "_plus6"
  type: "Eltwise"
  bottom: "stage4_unit1_bn3"
  bottom: "stage4_unit1_sc"
  top: "_plus6"
  eltwise_param { operation: SUM }
}

layer {
  bottom: "_plus6"
  top: "stage4_unit2_bn1"
  name: "stage4_unit2_bn1"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.9
    eps: 2e-05
  }
}
layer {
  bottom: "stage4_unit2_bn1"
  top: "stage4_unit2_bn1"
  name: "stage4_unit2_bn1_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
	bottom: "stage4_unit2_bn1"
	top: "stage4_unit2_conv1"
	name: "stage4_unit2_conv1"
	type: "Convolution"
    param {
      lr_mult: 1
      decay_mult: 1
    }
	convolution_param {
		num_output: 512
		kernel_size: 3
		pad: 1
		stride: 1    
        weight_filler {
           type: "gaussian"
           std: 0.01
        }
        engine:CAFFE
		bias_term: false
	}
}

layer {
  bottom: "stage4_unit2_conv1"
  top: "stage4_unit2_bn2"
  name: "stage4_unit2_bn2"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.9
    eps: 2e-05
  }
}
layer {
  bottom: "stage4_unit2_bn2"
  top: "stage4_unit2_bn2"
  name: "stage4_unit2_bn2_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "stage4_unit2_bn2"
  top: "stage4_unit2_relu1"
  name: "stage4_unit2_relu1"
  type: "ReLU"
}

layer {
	bottom: "stage4_unit2_relu1"
	top: "stage4_unit2_conv2"
	name: "stage4_unit2_conv2"
	type: "Convolution"
    param {
      lr_mult: 1
      decay_mult: 1
    }
	convolution_param {
		num_output: 512
		kernel_size: 3
		pad: 1
		stride: 1    
        weight_filler {
           type: "gaussian"
           std: 0.01
        }
        engine:CAFFE
		bias_term: false
	}
}

layer {
  bottom: "stage4_unit2_conv2"
  top: "stage4_unit2_bn3"
  name: "stage4_unit2_bn3"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats:false
    moving_average_fraction: 0.9
    eps: 2e-05
  }
}
layer {
  bottom: "stage4_unit2_bn3"
  top: "stage4_unit2_bn3"
  name: "stage4_unit2_bn3_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  name: "_plus7"
  type: "Eltwise"
  bottom: "stage4_unit2_bn3"
  bottom: "_plus6"
  top: "_plus7"
  eltwise_param { operation: SUM }
}

layer {
  bottom: "_plus7"
  top: "bn1"
  name: "bn1"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
    moving_average_fraction: 0.9
    eps: 2e-05
  }
}
layer {
  bottom: "bn1"
  top: "bn1"
  name: "bn1_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "bn1"
  top: "fc8"
  name: "fc8"
  type: "InnerProduct"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
        type: "msra"
        std:0.01
    }
    bias_filler {
        type:"constant"
        value:0
    }
  }
}
layer{
    name:"accuracy"
    type:"Accuracy"
    bottom:"fc8"
    bottom:"label"
    top:"accuracy"
    include{
        phase:TEST
    }
}
layer{
    name:"loss"
    type:"WeightedSoftmaxWithLoss"
    bottom:"fc8"
    bottom:"label"
    top:"loss"
    softmax_param{
     pos_cid:1
     pos_mult:1.3
    }
}
